Revit 2027 API
BuiltInFailures.FabricFailures.BendPolylineInvalid Property
 The bend profile contains too short of a segment to apply the wire bend diameter. Cannot create a bent fabric sheet for this type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId BendPolylineInvalid { get; }
Public Shared ReadOnly Property BendPolylineInvalid As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ BendPolylineInvalid {
	FailureDefinitionId^ get ();
}
static member BendPolylineInvalid : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FabricFailures Class
Autodesk.Revit.DB Namespace